{"config": {"output_layers": [["dense_38", 0, 0]], "name": "model_12", "input_layers": [["input_23", 0, 0], ["input_24", 0, 0]], "layers": [{"name": "input_23", "class_name": "InputLayer", "config": {"name": "input_23", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 101, 12]}, "inbound_nodes": []}, {"name": "input_24", "class_name": "InputLayer", "config": {"name": "input_24", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 101, 12]}, "inbound_nodes": []}, {"name": "lambda_23", "class_name": "Lambda", "config": {"trainable": true, "arguments": {}, "name": "lambda_23", "output_shape_type": "raw", "output_shape": null, "function_type": "lambda", "function": ["4wEAAAAAAAAAAQAAAAMAAABTAAAAcxMAAAB0AABqAQBqAgB8AABkAgCDAgBTKQNO6QEAAADp////\n/ykD2gVrZXJhc9oHYmFja2VuZNoLZXhwYW5kX2RpbXMpAdoBeKkAcgcAAAD6HzxpcHl0aG9uLWlu\ncHV0LTE2LTYyMjFlMGE2MDk2Nj7aCDxsYW1iZGE+HwAAAHMAAAAA\n", null, null]}, "inbound_nodes": [[["input_23", 0, 0, {}]]]}, {"name": "lambda_24", "class_name": "Lambda", "config": {"trainable": true, "arguments": {}, "name": "lambda_24", "output_shape_type": "raw", "output_shape": null, "function_type": "lambda", "function": ["4wEAAAAAAAAAAQAAAAMAAABTAAAAcxMAAAB0AABqAQBqAgB8AABkAgCDAgBTKQNO6QEAAADp////\n/ykD2gVrZXJhc9oHYmFja2VuZNoLZXhwYW5kX2RpbXMpAdoBeKkAcgcAAAD6HzxpcHl0aG9uLWlu\ncHV0LTE2LTYyMjFlMGE2MDk2Nj7aCDxsYW1iZGE+IAAAAHMAAAAA\n", null, null]}, "inbound_nodes": [[["input_24", 0, 0, {}]]]}, {"name": "concatenate_12", "class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_12", "axis": -1}, "inbound_nodes": [[["lambda_23", 0, 0, {}], ["lambda_24", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"kernel_size": [34, 3], "name": "conv2d_23", "strides": [1, 1], "padding": "valid", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "data_format": "channels_last", "use_bias": true, "activation": "relu", "filters": 80, "kernel_constraint": null}, "inbound_nodes": [[["concatenate_12", 0, 0, {}]]]}, {"name": "max_pooling2d_23", "class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [3, 3], "name": "max_pooling2d_23", "strides": [3, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"kernel_size": [3, 1], "name": "conv2d_24", "strides": [3, 1], "padding": "valid", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "data_format": "channels_last", "use_bias": true, "activation": "relu", "filters": 80, "kernel_constraint": null}, "inbound_nodes": [[["max_pooling2d_23", 0, 0, {}]]]}, {"name": "max_pooling2d_24", "class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [3, 1], "name": "max_pooling2d_24", "strides": [3, 1], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"name": "dropout_36", "class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_36", "seed": null, "rate": 0.5}, "inbound_nodes": [[["max_pooling2d_24", 0, 0, {}]]]}, {"name": "flatten_12", "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_12", "data_format": "channels_last"}, "inbound_nodes": [[["dropout_36", 0, 0, {}]]]}, {"name": "dense_36", "class_name": "Dense", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_36", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "trainable": true, "use_bias": true, "units": 5000, "kernel_constraint": null}, "inbound_nodes": [[["flatten_12", 0, 0, {}]]]}, {"name": "dropout_37", "class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_37", "seed": null, "rate": 0.5}, "inbound_nodes": [[["dense_36", 0, 0, {}]]]}, {"name": "dense_37", "class_name": "Dense", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_37", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "trainable": true, "use_bias": true, "units": 5000, "kernel_constraint": null}, "inbound_nodes": [[["dropout_37", 0, 0, {}]]]}, {"name": "dropout_38", "class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_38", "seed": null, "rate": 0.5}, "inbound_nodes": [[["dense_37", 0, 0, {}]]]}, {"name": "dense_38", "class_name": "Dense", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_38", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "units": 6, "kernel_constraint": null}, "inbound_nodes": [[["dropout_38", 0, 0, {}]]]}]}, "class_name": "Model", "keras_version": "2.1.6", "backend": "tensorflow"}