{"backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["dense_3", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 101, 12, 1]}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "conv2d_1", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "filters": 80, "data_format": "channels_last", "kernel_size": [34, 3]}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"padding": "valid", "data_format": "channels_last", "strides": [3, 1], "trainable": true, "name": "max_pooling2d_1", "pool_size": [3, 3]}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"name": "conv2d_2", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "padding": "valid", "strides": [3, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "filters": 80, "data_format": "channels_last", "kernel_size": [3, 1]}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"padding": "valid", "data_format": "channels_last", "strides": [3, 1], "trainable": true, "name": "max_pooling2d_2", "pool_size": [3, 1]}}, {"class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"noise_shape": null, "trainable": true, "seed": null, "rate": 0.5, "name": "dropout_1"}}, {"class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "units": 5000, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null}}, {"class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"noise_shape": null, "trainable": true, "seed": null, "rate": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"name": "dense_2", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "units": 5000, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null}}, {"class_name": "Dropout", "name": "dropout_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"noise_shape": null, "trainable": true, "seed": null, "rate": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"name": "dense_3", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "activation": "softmax", "units": 6, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null}}], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.1.6"}